/*
Определить, кто и сколько потратил в июне 2005
Используйте конструкцию "as costs" для отображения затраченной суммы членом семьи. Это необходимо для корректной проверки.
Таблица: FamilyMembers (Члены семьи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| member_id     | INT         | PK, Уникальный ID члена семьи     |
| status        | VARCHAR     | Статус (роль в семье)             |
| member_name   | VARCHAR     | Имя                               |
| birthday      | TIMESTAMP   | Дата рождения                     |
+---------------+-------------+-----------------------------------+

Таблица: GoodTypes (Типы товаров)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| good_type_id   | INT         | PK, Уникальный ID типа товара     |
| good_type_name | VARCHAR     | Название категории/типа           |
+----------------+-------------+-----------------------------------+

Таблица: Goods (Товары)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| good_id       | INT         | PK, Уникальный ID товара          |
| good_name     | VARCHAR     | Название товара                   |
| type          | INT         | FK, Ссылка на GoodTypes           |
+---------------+-------------+-----------------------------------+

Таблица: Payments (Платежи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| payment_id    | INT         | PK, Уникальный ID платежа         |
| family_member | INT         | FK, Ссылка на FamilyMembers       |
| good          | INT         | FK, Ссылка на Goods               |
| amount        | INT         | Количество купленного товара      |
| unit_price    | INT         | Цена за единицу                   |
| date          | TIMESTAMP   | Дата совершения покупки           |
+---------------+-------------+-----------------------------------+
*/
SELECT
    FamilyMembers.member_name, SUM(Payments.amount * Payments.unit_price) AS costs
FROM
    FamilyMembers
JOIN
    Payments
ON
    FamilyMembers.member_id = Payments.family_member
WHERE YEAR(Payments.date) = '2005' AND MONTH(Payments.date) = 6
GROUP BY
    FamilyMembers.member_id