/*
Найдите среднюю цену икры на основе данных, хранящихся в таблице Payments.
В базе данных хранятся данные о покупках красной (red caviar) и черной икры (black caviar).
В ответе должна быть одна строка со средней ценой всей купленной когда-либо икры.
Используйте конструкцию "as cost" для агрегатной функции подсчета средней цены икры.
Это необходимо для корректной проверки.
Таблица: FamilyMembers (Члены семьи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| member_id     | INT         | PK, Уникальный ID члена семьи     |
| status        | VARCHAR     | Статус (роль в семье)             |
| member_name   | VARCHAR     | Имя                               |
| birthday      | TIMESTAMP   | Дата рождения                     |
+---------------+-------------+-----------------------------------+

Таблица: GoodTypes (Типы товаров)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| good_type_id   | INT         | PK, Уникальный ID типа товара     |
| good_type_name | VARCHAR     | Название категории/типа           |
+----------------+-------------+-----------------------------------+

Таблица: Goods (Товары)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| good_id       | INT         | PK, Уникальный ID товара          |
| good_name     | VARCHAR     | Название товара                   |
| type          | INT         | FK, Ссылка на GoodTypes           |
+---------------+-------------+-----------------------------------+

Таблица: Payments (Платежи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| payment_id    | INT         | PK, Уникальный ID платежа         |
| family_member | INT         | FK, Ссылка на FamilyMembers       |
| good          | INT         | FK, Ссылка на Goods               |
| amount        | INT         | Количество купленного товара      |
| unit_price    | INT         | Цена за единицу                   |
| date          | TIMESTAMP   | Дата совершения покупки           |
+---------------+-------------+-----------------------------------+
 */
SELECT
    AVG(Payments.unit_price) AS cost
FROM
    Payments
JOIN
    Goods
ON
    Payments.good = Goods.good_id
WHERE
    Goods.good_name
LIKE
    '%caviar'