/*
Какие кабинеты чаще всего использовались для проведения занятий?
Выведите те, которые использовались максимальное количество раз.
Таблица: Timepair (Время занятий)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID временной пары  |
| start_pair    | TIME        | Время начала занятия              |
| end_pair      | TIME        | Время окончания занятия           |
+---------------+-------------+-----------------------------------+

Таблица: Teacher (Преподаватели)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID преподавателя   |
| first_name    | VARCHAR     | Имя                               |
| middle_name   | VARCHAR     | Отчество                          |
| last_name     | VARCHAR     | Фамилия                           |
+---------------+-------------+-----------------------------------+

Таблица: Subject (Предметы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID предмета        |
| name          | VARCHAR     | Название предмета                 |
+---------------+-------------+-----------------------------------+

Таблица: Class (Классы/Группы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID класса          |
| name          | VARCHAR     | Название (номер) класса           |
+---------------+-------------+-----------------------------------+

Таблица: Schedule (Расписание)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи распис.  |
| date          | DATE        | Дата занятия                      |
| class         | INT         | FK, Ссылка на Class               |
| number_pair   | INT         | FK, Ссылка на Timepair            |
| teacher       | INT         | FK, Ссылка на Teacher             |
| subject       | INT         | FK, Ссылка на Subject             |
| classroom     | INT         | Номер аудитории/кабинета          |
+---------------+-------------+-----------------------------------+

Таблица: Student (Студенты/Ученики)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID студента        |
| first_name    | VARCHAR     | Имя                               |
| middle_name   | VARCHAR     | Отчество                          |
| last_name     | VARCHAR     | Фамилия                           |
| birthday      | DATE        | Дата рождения                     |
| address       | VARCHAR     | Адрес проживания                  |
+---------------+-------------+-----------------------------------+

Таблица: Student_in_class (Связь студентов и классов)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи          |
| class         | INT         | FK, Ссылка на Class               |
| student       | INT         | FK, Ссылка на Student             |
+---------------+-------------+-----------------------------------+
 */
SELECT
    Schedule.classroom
FROM
    Schedule
GROUP BY
    Schedule.classroom
HAVING
    COUNT(Schedule.id) = (SELECT
                              COUNT(*) AS cnt
                          FROM
                              Schedule
                          GROUP BY
                              Schedule.classroom
                          ORDER BY
                              cnt DESC
    LIMIT 1)