/*
Какой процент обучающихся учится в "10 A" классе?
Выведите ответ в диапазоне от 0 до 100 с округлением до четырёх знаков после запятой, например, 96.0201.
Используйте конструкцию "as percent" для представления результата вычисления.
Это необходимо для корректной проверки.
Таблица: Timepair (Время занятий)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID временной пары  |
| start_pair    | TIME        | Время начала занятия              |
| end_pair      | TIME        | Время окончания занятия           |
+---------------+-------------+-----------------------------------+

Таблица: Teacher (Преподаватели)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID преподавателя   |
| first_name    | VARCHAR     | Имя                               |
| middle_name   | VARCHAR     | Отчество                          |
| last_name     | VARCHAR     | Фамилия                           |
+---------------+-------------+-----------------------------------+

Таблица: Subject (Предметы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID предмета        |
| name          | VARCHAR     | Название предмета                 |
+---------------+-------------+-----------------------------------+

Таблица: Class (Классы/Группы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID класса          |
| name          | VARCHAR     | Название (номер) класса           |
+---------------+-------------+-----------------------------------+

Таблица: Schedule (Расписание)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи распис.  |
| date          | DATE        | Дата занятия                      |
| class         | INT         | FK, Ссылка на Class               |
| number_pair   | INT         | FK, Ссылка на Timepair            |
| teacher       | INT         | FK, Ссылка на Teacher             |
| subject       | INT         | FK, Ссылка на Subject             |
| classroom     | INT         | Номер аудитории/кабинета          |
+---------------+-------------+-----------------------------------+

Таблица: Student (Студенты/Ученики)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID студента        |
| first_name    | VARCHAR     | Имя                               |
| middle_name   | VARCHAR     | Отчество                          |
| last_name     | VARCHAR     | Фамилия                           |
| birthday      | DATE        | Дата рождения                     |
| address       | VARCHAR     | Адрес проживания                  |
+---------------+-------------+-----------------------------------+

Таблица: Student_in_class (Связь студентов и классов)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи          |
| class         | INT         | FK, Ссылка на Class               |
| student       | INT         | FK, Ссылка на Student             |
+---------------+-------------+-----------------------------------+
 */
SELECT
    ROUND(
            (
                SELECT
                    COUNT(*)
                FROM
                    Student_in_class sc
                JOIN
                    Class AS c
                ON
                    sc.class = c.id
                WHERE
                    c.name = '10 A'
            )
            /
            (
                SELECT COUNT(*)
                FROM Student_in_class
            ) * 100, 4
    )
        AS percent