/*
Добавьте товар с именем "Cheese" и типом "food" в список товаров (Goods).
В качестве первичного ключа (good_id) укажите количество записей в таблице + 1.
Таблица: FamilyMembers (Члены семьи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| member_id     | INT         | PK, Уникальный ID члена семьи     |
| status        | VARCHAR     | Статус (роль в семье)             |
| member_name   | VARCHAR     | Имя                               |
| birthday      | TIMESTAMP   | Дата рождения                     |
+---------------+-------------+-----------------------------------+

Таблица: GoodTypes (Типы товаров)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| good_type_id   | INT         | PK, Уникальный ID типа товара     |
| good_type_name | VARCHAR     | Название категории/типа           |
+----------------+-------------+-----------------------------------+

Таблица: Goods (Товары)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| good_id       | INT         | PK, Уникальный ID товара          |
| good_name     | VARCHAR     | Название товара                   |
| type          | INT         | FK, Ссылка на GoodTypes           |
+---------------+-------------+-----------------------------------+

Таблица: Payments (Платежи)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| payment_id    | INT         | PK, Уникальный ID платежа         |
| family_member | INT         | FK, Ссылка на FamilyMembers       |
| good          | INT         | FK, Ссылка на Goods               |
| amount        | INT         | Количество купленного товара      |
| unit_price    | INT         | Цена за единицу                   |
| date          | TIMESTAMP   | Дата совершения покупки           |
+---------------+-------------+-----------------------------------+
 */
INSERT INTO
    Goods
SELECT
    COUNT(*) + 1,
    'Cheese',
    (SELECT good_type_id FROM GoodTypes
     WHERE GoodTypes.good_type_name = 'food')
FROM Goods