/*
 Удалить компании, совершившие наименьшее количество рейсов.
 Таблица: Company (Авиакомпании)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID компании        |
| name          | VARCHAR     | Название компании                 |
+---------------+-------------+-----------------------------------+

Таблица: Passenger (Пассажиры)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID пассажира       |
| name          | VARCHAR     | Имя пассажира                     |
+---------------+-------------+-----------------------------------+

Таблица: Trip (Рейсы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID рейса           |
| company       | INT         | FK, Ссылка на Company             |
| plane         | VARCHAR     | Модель самолета                   |
| town_from     | VARCHAR     | Город отправления                 |
| town_to       | VARCHAR     | Город прибытия                    |
| time_out      | TIMESTAMP   | Время вылета                      |
| time_in       | TIMESTAMP   | Время прилета                     |
+---------------+-------------+-----------------------------------+

Таблица: Pass_in_trip (Билеты / Посадка на рейс)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи (билета) |
| trip          | INT         | FK, Ссылка на Trip                |
| passenger     | INT         | FK, Ссылка на Passenger           |
| place         | VARCHAR     | Место в салоне (например, '1a')   |
+---------------+-------------+-----------------------------------+
 */
DELETE FROM
    Company
WHERE
    Company.id IN
    (
        SELECT
            Trip.company
        FROM
            Trip
        GROUP BY
            Trip.company
        HAVING
            COUNT(Trip.id) =
            (
                SELECT
                    COUNT(Trip.id) AS cnt
                FROM
                    Trip
                GROUP BY
                    Trip.company
                ORDER BY
                    cnt
    LIMIT 1
    )
    )