/*
Вывести в порядке убывания популярности доменные имена 2-го уровня, используемые пользователями для электронной почты.
Полученный результат необходимо дополнительно отсортировать по возрастанию названий доменных имён.
Для эл. почты index@gmail.com доменным именем 2-го уровня будет gmail.com.
Таблица: Users (Пользователи)
+-------------------+-------------+-----------------------------------+
| Столбец           | Тип данных  | Описание                          |
+-------------------+-------------+-----------------------------------+
| id                | INT         | PK, Уникальный ID пользователя    |
| name              | VARCHAR     | Имя пользователя                  |
| email             | VARCHAR     | Email                             |
| email_verified_at | TIMESTAMP   | Дата и время подтверждения email  |
| password          | VARCHAR     | Пароль                            |
| phone_number      | VARCHAR     | Номер телефона                    |
+-------------------+-------------+-----------------------------------+

Таблица: Rooms (Жилье / Комнаты)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID комнаты/жилья   |
| home_type     | VARCHAR     | Тип жилья                         |
| address       | VARCHAR     | Адрес                             |
| has_tv        | BOOLEAN     | Наличие ТВ                        |
| has_internet  | BOOLEAN     | Наличие интернета                 |
| has_kitchen   | BOOLEAN     | Наличие кухни                     |
| has_air_con   | BOOLEAN     | Наличие кондиционера              |
| price         | INT         | Цена за ночь                      |
| owner_id      | INT         | FK, Ссылка на Users (Владелец)    |
| latitude      | REAL        | Широта                            |
| longitude     | REAL        | Долгота                           |
+---------------+-------------+-----------------------------------+

Таблица: Reservations (Бронирования)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID бронирования    |
| user_id       | INT         | FK, Ссылка на Users (Арендатор)   |
| room_id       | INT         | FK, Ссылка на Rooms               |
| start_date    | TIMESTAMP   | Время начала брони                |
| end_date      | TIMESTAMP   | Время окончания брони             |
| price         | INT         | Цена за ночь на момент брони      |
| total         | INT         | Итоговая стоимость                |
+---------------+-------------+-----------------------------------+

Таблица: Reviews (Отзывы)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| id             | INT         | PK, Уникальный ID отзыва          |
| reservation_id | INT         | FK, Ссылка на Reservations        |
| rating         | INT         | Оценка (рейтинг)                  |
+----------------+-------------+-----------------------------------+
 */
SELECT
    SUBSTRING(Users.email,
              LOCATE('@', Users.email) + 1,
              CHAR_LENGTH(Users.email) - LOCATE('@', Users.email))
    AS domain,
    COUNT(Users.id)
    AS count
FROM
    Users
GROUP BY
    domain
ORDER BY
    count
    DESC,
    domain