/*
Вывести список комнат со всеми удобствами (наличие ТВ, интернета, кухни и кондиционера),
а также общее количество дней и сумму за все дни аренды каждой из таких комнат.
Используйте конструкции "as days" и "as total_fee" для вывода количества дней и суммы аренды, соответственно.
Если комната не сдавалась, то количество дней и сумму вывести как 0.
Таблица: Users (Пользователи)
+-------------------+-------------+-----------------------------------+
| Столбец           | Тип данных  | Описание                          |
+-------------------+-------------+-----------------------------------+
| id                | INT         | PK, Уникальный ID пользователя    |
| name              | VARCHAR     | Имя пользователя                  |
| email             | VARCHAR     | Email                             |
| email_verified_at | TIMESTAMP   | Дата и время подтверждения email  |
| password          | VARCHAR     | Пароль                            |
| phone_number      | VARCHAR     | Номер телефона                    |
+-------------------+-------------+-----------------------------------+

Таблица: Rooms (Жилье / Комнаты)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID комнаты/жилья   |
| home_type     | VARCHAR     | Тип жилья                         |
| address       | VARCHAR     | Адрес                             |
| has_tv        | BOOLEAN     | Наличие ТВ                        |
| has_internet  | BOOLEAN     | Наличие интернета                 |
| has_kitchen   | BOOLEAN     | Наличие кухни                     |
| has_air_con   | BOOLEAN     | Наличие кондиционера              |
| price         | INT         | Цена за ночь                      |
| owner_id      | INT         | FK, Ссылка на Users (Владелец)    |
| latitude      | REAL        | Широта                            |
| longitude     | REAL        | Долгота                           |
+---------------+-------------+-----------------------------------+

Таблица: Reservations (Бронирования)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID бронирования    |
| user_id       | INT         | FK, Ссылка на Users (Арендатор)   |
| room_id       | INT         | FK, Ссылка на Rooms               |
| start_date    | TIMESTAMP   | Время начала брони                |
| end_date      | TIMESTAMP   | Время окончания брони             |
| price         | INT         | Цена за ночь на момент брони      |
| total         | INT         | Итоговая стоимость                |
+---------------+-------------+-----------------------------------+

Таблица: Reviews (Отзывы)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| id             | INT         | PK, Уникальный ID отзыва          |
| reservation_id | INT         | FK, Ссылка на Reservations        |
| rating         | INT         | Оценка (рейтинг)                  |
+----------------+-------------+-----------------------------------+
 */
SELECT
    Rooms.home_type,
    Rooms.address,
    IFNULL(SUM(TIMESTAMPDIFF(DAY, Reservations.start_date, Reservations.end_date)), 0) AS days,
    IFNULL(SUM(total), 0) AS total_fee
FROM
    Rooms
    LEFT JOIN
        Reservations
    ON
        Rooms.id = Reservations.room_id
WHERE
    has_tv AND has_air_con AND has_internet AND has_kitchen
GROUP BY
    Rooms.id