/*
Вывести время отлета и время прилета для каждого перелета в формате "ЧЧ:ММ, ДД.ММ - ЧЧ:ММ, ДД.ММ",
где часы и минуты с ведущим нулем, а день и месяц без.
Используйте конструкции "as flight_time" для полученной строки с датами отлета и прилета.
Таблица: Company (Авиакомпании)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID компании        |
| name          | VARCHAR     | Название компании                 |
+---------------+-------------+-----------------------------------+

Таблица: Passenger (Пассажиры)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID пассажира       |
| name          | VARCHAR     | Имя пассажира                     |
+---------------+-------------+-----------------------------------+

Таблица: Trip (Рейсы)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID рейса           |
| company       | INT         | FK, Ссылка на Company             |
| plane         | VARCHAR     | Модель самолета                   |
| town_from     | VARCHAR     | Город отправления                 |
| town_to       | VARCHAR     | Город прибытия                    |
| time_out      | TIMESTAMP   | Время вылета                      |
| time_in       | TIMESTAMP   | Время прилета                     |
+---------------+-------------+-----------------------------------+

Таблица: Pass_in_trip (Билеты / Посадка на рейс)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID записи (билета) |
| trip          | INT         | FK, Ссылка на Trip                |
| passenger     | INT         | FK, Ссылка на Passenger           |
| place         | VARCHAR     | Место в салоне (например, '1a')   |
+---------------+-------------+-----------------------------------+
 */
SELECT
    CONCAT(
            DATE_FORMAT(Trip.time_out, '%H:%i'),
            ', ',
            DATE_FORMAT(Trip.time_out, '%e.%c'),
            ' - ',
            DATE_FORMAT(Trip.time_in, '%H:%i'),
            ', ',
            DATE_FORMAT(Trip.time_in, '%e.%c')
    )
        AS
        flight_time
FROM
    Trip