/*
Для каждой комнаты, которую снимали как минимум 1 раз, найдите имя человека,
снимавшего ее последний раз, и дату, когда он выехал
Используйте конструкцию "as room_id" для вывода идентификатора комнаты
Таблица: Users (Пользователи)
+-------------------+-------------+-----------------------------------+
| Столбец           | Тип данных  | Описание                          |
+-------------------+-------------+-----------------------------------+
| id                | INT         | PK, Уникальный ID пользователя    |
| name              | VARCHAR     | Имя пользователя                  |
| email             | VARCHAR     | Email                             |
| email_verified_at | TIMESTAMP   | Дата и время подтверждения email  |
| password          | VARCHAR     | Пароль                            |
| phone_number      | VARCHAR     | Номер телефона                    |
+-------------------+-------------+-----------------------------------+

Таблица: Rooms (Жилье / Комнаты)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID комнаты/жилья   |
| home_type     | VARCHAR     | Тип жилья                         |
| address       | VARCHAR     | Адрес                             |
| has_tv        | BOOLEAN     | Наличие ТВ                        |
| has_internet  | BOOLEAN     | Наличие интернета                 |
| has_kitchen   | BOOLEAN     | Наличие кухни                     |
| has_air_con   | BOOLEAN     | Наличие кондиционера              |
| price         | INT         | Цена за ночь                      |
| owner_id      | INT         | FK, Ссылка на Users (Владелец)    |
| latitude      | REAL        | Широта                            |
| longitude     | REAL        | Долгота                           |
+---------------+-------------+-----------------------------------+

Таблица: Reservations (Бронирования)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID бронирования    |
| user_id       | INT         | FK, Ссылка на Users (Арендатор)   |
| room_id       | INT         | FK, Ссылка на Rooms               |
| start_date    | TIMESTAMP   | Время начала брони                |
| end_date      | TIMESTAMP   | Время окончания брони             |
| price         | INT         | Цена за ночь на момент брони      |
| total         | INT         | Итоговая стоимость                |
+---------------+-------------+-----------------------------------+

Таблица: Reviews (Отзывы)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| id             | INT         | PK, Уникальный ID отзыва          |
| reservation_id | INT         | FK, Ссылка на Reservations        |
| rating         | INT         | Оценка (рейтинг)                  |
+----------------+-------------+-----------------------------------+
 */
SELECT
    Sorted_Table.room_id,
    Sorted_Table.name,
    Sorted_Table.end_date
FROM
    (SELECT
         Reservations.room_id,
         Users.name,
         Reservations.end_date,
         ROW_NUMBER() OVER
         (PARTITION BY
             Reservations.room_id
         ORDER BY
             Reservations.start_date DESC) AS rn
     FROM
         Reservations
         JOIN
            Users
         ON
             Reservations.user_id = Users.id) AS Sorted_Table
WHERE
    rn = 1