/*
Необходимо категоризовать жилье на economy, comfort, premium по цене соответственно <= 100, 100 < цена < 200, >= 200.
В качестве результата вывести таблицу с названием категории и количеством жилья, попадающего в данную категорию
Используйте конструкцию "as category" и "as count" для вывода названия категории и количества такого жилья соответственно.
Таблица: Users (Пользователи)
+-------------------+-------------+-----------------------------------+
| Столбец           | Тип данных  | Описание                          |
+-------------------+-------------+-----------------------------------+
| id                | INT         | PK, Уникальный ID пользователя    |
| name              | VARCHAR     | Имя пользователя                  |
| email             | VARCHAR     | Email                             |
| email_verified_at | TIMESTAMP   | Дата и время подтверждения email  |
| password          | VARCHAR     | Пароль                            |
| phone_number      | VARCHAR     | Номер телефона                    |
+-------------------+-------------+-----------------------------------+

Таблица: Rooms (Жилье / Комнаты)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID комнаты/жилья   |
| home_type     | VARCHAR     | Тип жилья                         |
| address       | VARCHAR     | Адрес                             |
| has_tv        | BOOLEAN     | Наличие ТВ                        |
| has_internet  | BOOLEAN     | Наличие интернета                 |
| has_kitchen   | BOOLEAN     | Наличие кухни                     |
| has_air_con   | BOOLEAN     | Наличие кондиционера              |
| price         | INT         | Цена за ночь                      |
| owner_id      | INT         | FK, Ссылка на Users (Владелец)    |
| latitude      | REAL        | Широта                            |
| longitude     | REAL        | Долгота                           |
+---------------+-------------+-----------------------------------+

Таблица: Reservations (Бронирования)
+---------------+-------------+-----------------------------------+
| Столбец       | Тип данных  | Описание                          |
+---------------+-------------+-----------------------------------+
| id            | INT         | PK, Уникальный ID бронирования    |
| user_id       | INT         | FK, Ссылка на Users (Арендатор)   |
| room_id       | INT         | FK, Ссылка на Rooms               |
| start_date    | TIMESTAMP   | Время начала брони                |
| end_date      | TIMESTAMP   | Время окончания брони             |
| price         | INT         | Цена за ночь на момент брони      |
| total         | INT         | Итоговая стоимость                |
+---------------+-------------+-----------------------------------+

Таблица: Reviews (Отзывы)
+----------------+-------------+-----------------------------------+
| Столбец        | Тип данных  | Описание                          |
+----------------+-------------+-----------------------------------+
| id             | INT         | PK, Уникальный ID отзыва          |
| reservation_id | INT         | FK, Ссылка на Reservations        |
| rating         | INT         | Оценка (рейтинг)                  |
+----------------+-------------+-----------------------------------+
 */
SELECT
    Category_Table.category,
    COUNT(*) AS count
FROM
    (SELECT
    Rooms.id,
    CASE
        WHEN Rooms.price <= 100 THEN 'economy'
        WHEN Rooms.price > 100 AND Rooms.price < 200
    THEN 'comfort'
        WHEN Rooms.price >= 200 THEN 'premium'
    END
    AS category
    FROM
    Rooms
    ) AS Category_Table
GROUP BY
    Category_Table.category